src/Documents/ВводНачальныхОстатковПоРегиструЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатковПоРегиструЦеныНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЦеныНоменклатуры</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрайсПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрайсыПоставщиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРуб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЕвро</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаДоллар</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Обновил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ВводНачальныхОстатковПоРегиструЦеныНоменклатуры/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ц1.Ссылка.Дата КАК Период,
	|	Ц1.Ссылка КАК Регистратор,
	|	&ТипЦенРубли КАК ТипЦен,
	|	Ц1.Номенклатура,
	|	&ВалютаРубль КАК Валюта,
	|	Ц1.ЦенаРуб КАК Цена,
	|	Ц1.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения
	|ИЗ
	|	Документ.ВводНачальныхОстатковПоРегиструЦеныНоменклатуры.ЦеныНоменклатуры КАК Ц1
	|ГДЕ
	|	Ц1.Ссылка = &Ссылка
	|	И Ц1.ЦенаРуб > 0
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ц2.Ссылка.Дата,
	|	Ц2.Ссылка,
	|	&ТипЦенДоллар,
	|	Ц2.Номенклатура,
	|	&ВалютаДоллар,
	|	Ц2.ЦенаДоллар,
	|	Ц2.Номенклатура.ЕдиницаХраненияОстатков
	|ИЗ
	|	Документ.ВводНачальныхОстатковПоРегиструЦеныНоменклатуры.ЦеныНоменклатуры КАК Ц2
	|ГДЕ
	|	Ц2.Ссылка = &Ссылка
	|	И Ц2.ЦенаДоллар > 0
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ц3.Ссылка.Дата,
	|	Ц3.Ссылка,
	|	&ТипЦенЕвро,
	|	Ц3.Номенклатура,
	|	&ВалютаЕвро,
	|	Ц3.ЦенаЕвро,
	|	Ц3.Номенклатура.ЕдиницаХраненияОстатков
	|ИЗ
	|	Документ.ВводНачальныхОстатковПоРегиструЦеныНоменклатуры.ЦеныНоменклатуры КАК Ц3
	|ГДЕ
	|	Ц3.Ссылка = &Ссылка
	|	И Ц3.ЦенаЕвро > 0"
	);
	Запрос.УстановитьПараметр("ТипЦенРубли", Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001"));
	Запрос.УстановитьПараметр("ТипЦенДоллар", Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000002"));
	Запрос.УстановитьПараметр("ТипЦенЕвро", Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000003"));
	Запрос.УстановитьПараметр("ВалютаРубль", Константы.ВалютаРубль.Получить());
	Запрос.УстановитьПараметр("ВалютаДоллар", Константы.ВалютаДоллар.Получить());
	Запрос.УстановитьПараметр("ВалютаЕвро", Константы.ВалютаРубль.Получить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	нз = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	нз.Отбор.Регистратор.ВидСравнения = ВидСравнения.Равно;
	нз.Отбор.Регистратор.Значение = Ссылка;
	нз.Отбор.Регистратор.Использование = Истина;
	
	нз.Загрузить(Запрос.Выполнить().Выгрузить());
	нз.Записать(Истина);
	
КонецПроцедуры
